// هر روز ی دونه roadmap , ی دونه تسک پیشنهادی مثل bom 
// json , promise , fetch , async/await
// نسخه های جدید js6 , ecma یادت نره 
// از هر چیز ب درد بخوری تو dom , bom , event و همه چی 
// bind کردن 
// callback چیه 
// DOM Manipulation
// Event Handling و Delegation
// Iterables & Iterators
// spread 
// Rest , paginate
// ES6+ Features , Memory Management
// bubbling چیه 
// sync , async , map , Map 
// داینامیک کردن 
// شکافتن دام به eventlistener و مثلش 
// شکافتن bom 
// شکافتن متد 
// شکافتن api 
// شکافتن event 
// مقایسه متدهای هر چیزی 
// هر روز ی تسک از تابع یا ارایه یا آبجکت بزن بذار بیشتر بشناسیش ، ی دونه هم جدا از api 

//************************************************************************/

// dom : خواندن محتوا , تغییر محتوا یا استایل , اضافه یا حذف المنت‌ها , گوش دادن به رویدادها  
// دسترسی مدرن : query ها 
// رویدادها : موس ، کیبرد ، فرم ، window , document , عناصر خاص ، کاربردی 


// تسک اصلی (دیجی کالا ) ی طرف ، تسک ریز ی طرف 
// بعد اونا roadmap 

// 2 , 3 , 4 , 5 , 6 مونده 

// آب و هوا ، اسکرول ، لایو سرچ ، دراپ داون ، ساید بار ، تیلویند ، اچ تی ام ال 5 

// بازم تسک کاربردی بپرس 

// بعدش roamap 

// بعدش react 

// برای html نسخه اخر برنامه ریزی کن 
// برای بهترش شدن css برنامه ریزی کن 
// برای مسلط شدن به git برنامه ریزی کن 
// ویدیو ببین jonas فقط 
